ХМНПФ_Общее/Documents/уп_РаспределениеИДОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РаспределениеИДОПС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИсточникИД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыИсточниковНачисленияИДОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>уп_ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДнейВГоду</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорыОПС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипСуммы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорОПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РублеДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПроцентДохода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>15</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаДохода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_РезервыОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РезервыОПС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВосполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Движение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДвиженияЕПС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.епс_ВидыДвиженияПенсионныхНакоплений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_ПрочиеНачисленияОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПрочиеНачисленияОПС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговаяБазаПоНДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВосполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыВыплат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Решение</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_Возврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_РаспределениеИДОПС/Ext/ObjectModule.bsl
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 05.02.2019 ШадринАВ // ДвижениеПоРезервам() // №2012
	// ХМНПФ 05.02.2019 ШадринАВ // ДвижениеПоДопРезервам() // №2012
	// ХМНПФ 19.02.2019 ШадринАВ // ДвижениеПоРезервам() // №2052
	// ХМНПФ 19.02.2019 ШадринАВ // ДвижениеПоДопРезервам() // №2052
	// ХМНПФ 19.02.2019 ШадринАВ // ДвижениеПоИнвестДоходу() // №2052
	// ХМНПФ 10.02.2020 ШадринАВ // ДвижениеПоИнвестДоходу() // №2667
	// ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоРезервам() // №3357
	// ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоДопРезервам() // №3357
	// ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоИнвестДоходу() // №3357
КонецПроцедуры

&ИзменениеИКонтроль("ДвижениеПоДопРезервам")
Процедура РасшОбщ_ДвижениеПоДопРезервам(ВидДвиженияСтрока, ДатаДвижения, СтрокаТаблицы, ТекСумма)
	Если ТипРезерва = Перечисления.уп_ТипыРезервовОПС.Выплатной Тогда
		Движение = Движения.уп_РезервыОПСНераспределенныеПлатежи.Добавить();
		Если ВидДвиженияСтрока = "Приход" Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;
		Движение.Период      = ДатаДвижения;
		Движение.Организация = Организация;
		Движение.ВидОперации = Перечисления.уп_ВидыОперацийПослеУчетнойДаты.ИнвестДоход;
		Движение.ДатаСобытия = КонецПериода;
		Движение.ДатаОтраженияСобытия = Дата;
		//Если СтрокаТаблицы.СостояниеДоговораОПС = Перечисления.уп_СостоянияДоговоровОПС.Закрыт
		//	и СтрокаТаблицы.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
		//	Движение.ДоговорОПС  = Справочники.уп_ДоговорыОПС.ПустаяСсылка();
		//Иначе
		#Удаление
		Если ПоДоговорам Тогда
     		Движение.ДоговорОПС  = СтрокаТаблицы.ДоговорОПС;
		КонецЕсли;	
		#КонецУдаления
		//КонецЕсли;
		#Вставка
		// +ХМНПФ 19.02.2019 ШадринАВ // ДвижениеПоДопРезервам() // №2052		
		Движение.ДоговорОПС  = СтрокаТаблицы.ДоговорОПС;
		// -ХМНПФ 19.02.2019 ШадринАВ // ДвижениеПоДопРезервам() // №2052
		#КонецВставки
		Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.Выплатной;
		Если ПоТипамСумм Тогда
			Движение.ТипСуммы  = СтрокаТаблицы.ТипСуммыРез;
		КонецЕсли;
		Движение.Сумма       = ТекСумма;
		Движение.ДокументРегистрации = ДокументРегистрации;
		Движение.Движение    = Перечисления.уп_ВидыДвижений.ИДОПСРПВ;
	ИначеЕсли ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервОПС Тогда
		Движение = Движения.уп_РезервыОПСНераспределенныеПлатежи.Добавить();
		Если ВидДвиженияСтрока = "Приход" Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;
		Движение.Период      = ДатаДвижения;
		Движение.Организация = Организация;
		Движение.ВидОперации = Перечисления.уп_ВидыОперацийПослеУчетнойДаты.ИнвестДоход;
		Движение.ДатаСобытия = КонецПериода;
		Движение.ДатаОтраженияСобытия = Дата;
		Движение.ДоговорОПС  = Справочники.уп_ДоговорыОПС.ПустаяСсылка();
		Движение.ТипРезерва = ТипРезерва;
		Движение.Сумма       = СтрокаТаблицы.ТипСуммы;
		Движение.ДокументРегистрации = ДокументРегистрации;
		Движение.Движение    = Перечисления.уп_ВидыДвижений.ИДОПС;
	Иначе	
		Движение = Движения.уп_РезервыОПСНераспределенныеПлатежи.Добавить();
		Если ВидДвиженияСтрока = "Приход" Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;
		Движение.Период      = ДатаДвижения;
		Движение.Организация = Организация;
		Движение.ВидОперации = Перечисления.уп_ВидыОперацийПослеУчетнойДаты.ИнвестДоход;
		Движение.ДатаСобытия = КонецПериода;
		Движение.ДатаОтраженияСобытия = Дата;
		Движение.ДоговорОПС  = СтрокаТаблицы.ДоговорОПС;
		Движение.ТипРезерва  = ТипРезерва;
		Если ВедетсяРезервНаследников И ЗначениеЗаполнено(СтрокаТаблицы.ДоговорОПС.ДатаРегистрацииСмерти) 
			И Дата > СтрокаТаблицы.ДоговорОПС.ДатаРегистрацииСмерти И СтрокаТаблицы.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
			Если ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
				Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН;
			ИначеЕсли ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты Тогда
				Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ;
			КонецЕсли;	
		КонецЕсли;
		
		//резерв ЕВ
		Если ВедетсяРезервЕВ И ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда 
			ПереводитьвРезервЕВ = Ложь;
			#Вставка
			// +ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоДопРезервам() // №3357
			Если НЕ (ЗначениеЗаполнено(СтрокаТаблицы.ДоговорОПС.ДатаРегистрацииСмерти)
				И Дата > СтрокаТаблицы.ДоговорОПС.ДатаРегистрацииСмерти И СтрокаТаблицы.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти) Тогда
			// -ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоДопРезервам() // №3357
			#КонецВставки
			Если  (ЗначениеЗаполнено(СтрокаТаблицы.ДатаРешенияОЕВ) И НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаРешенияОДоплате)) //не было решения о доплате
				ИЛИ (ЗначениеЗаполнено(СтрокаТаблицы.ДатаРешенияОЕВ) И ЗначениеЗаполнено(СтрокаТаблицы.ДатаРешенияОДоплате)
				#Удаление
				И ЗначениеЗаполнено(СтрокаТаблицы.ДатаРешенияОЕВ)> ЗначениеЗаполнено(СтрокаТаблицы.ДатаРешенияОДоплате)) Тогда   //было решение о доплате но по прошлому заявлению
				#КонецУдаления
				#Вставка
				// +ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоДопРезервам() // №3357
				И СтрокаТаблицы.ДатаРешенияОЕВ > СтрокаТаблицы.ДатаРешенияОДоплате) Тогда
				// -ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоДопРезервам() // №3357
				#КонецВставки
				Если СтрокаТаблицы.ВключатьДопВзносы Тогда
					ПереводитьвРезервЕВ = Истина;
				Иначе
					Если СтрокаТаблицы.ТипСуммы = Справочники.уп_ТипыСуммОПС.ВзносыФиз
						ИЛИ СтрокаТаблицы.ТипСуммы = Справочники.уп_ТипыСуммОПС.ИДФиз Тогда
						ПереводитьвРезервЕВ = Истина;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
			Если ПереводитьВРезервЕВ Тогда
				Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервЕВ;
			КонецЕсли;
			#Вставка
			// +ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоДопРезервам() // №3357
			КонецЕсли;
			// -ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоДопРезервам() // №3357
			#КонецВставки
		КонецЕсли;
		Движение.ТипСуммы    = СтрокаТаблицы.ТипСуммыРез;
		Движение.Сумма       = ТекСумма;
		Движение.ДокументРегистрации = ДокументРегистрации;
		Если ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты Тогда
			Движение.Движение    = Перечисления.уп_ВидыДвижений.ИДОПСРСВ;
		Иначе
			Движение.Движение    = Перечисления.уп_ВидыДвижений.ИДОПС;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ДвижениеПоИнвестДоходу")
Процедура РасшОбщ_ДвижениеПоИнвестДоходу(ТекДоговорОПС, ТекТипСуммы, ТекСумма, ТекРублеДни, ТекПроцент, СтрокаТаблицы)
	Движение = Движения.уп_ИнвестДоходОПС.Добавить();
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Если ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервОПС Тогда
		Движение.ДоговорОПС = Справочники.уп_ДоговорыОПС.ПустаяСсылка();
		Движение.ТипСуммы = Справочники.уп_ТипыСуммОПС.ПустаяСсылка();
	//ИначеЕсли ТипРезерва = Перечисления.уп_ТипыРезервовОПС.Выплатной И ТекСостояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт Тогда
	//	Движение.ДоговорОПС = Справочники.уп_ДоговорыОПС.ПустаяСсылка();
	//	Движение.ТипСуммы = Справочники.уп_ТипыСуммОПС.ПустаяСсылка();
	ИначеЕсли ТипРезерва = Перечисления.уп_ТипыРезервовОПС.Выплатной Тогда
		Если ПоДоговорам Тогда
			Движение.ДоговорОПС  = ТекДоговорОПС;
		КонецЕсли;
		Если ПоТипамСумм Тогда
			Движение.ТипСуммы  = ТекТипСуммы;
		КонецЕсли;
	Иначе
		Движение.ДоговорОПС = ТекДоговорОПС;
		Движение.ТипСуммы = ТекТипСуммы;
	КонецЕсли;
	Движение.ТипРезерва = ТипРезерва;
	Если ВедетсяРезервНаследников И ЗначениеЗаполнено(ТекДоговорОПС.ДатаРегистрацииСмерти) 
		И Дата > ТекДоговорОПС.ДатаРегистрацииСмерти И СтрокаТаблицы.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
		Если ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
			Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН;
		ИначеЕсли ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты Тогда
			Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ;
		КонецЕсли;	
	КонецЕсли;
		
	//резерв ЕВ
	Если ВедетсяРезервЕВ И ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда 
		ПереводитьвРезервЕВ = Ложь;
		#Вставка
		// +ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоИнвестДоходу() // №3357
		Если НЕ (ЗначениеЗаполнено(ТекДоговорОПС.ДатаРегистрацииСмерти)
			И Дата > ТекДоговорОПС.ДатаРегистрацииСмерти И СтрокаТаблицы.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти) Тогда
		// -ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоИнвестДоходу() // №3357
		#КонецВставки
		Если  (ЗначениеЗаполнено(СтрокаТаблицы.ДатаРешенияОЕВ) И НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаРешенияОДоплате)) //не было решения о доплате
			ИЛИ (ЗначениеЗаполнено(СтрокаТаблицы.ДатаРешенияОЕВ) И ЗначениеЗаполнено(СтрокаТаблицы.ДатаРешенияОДоплате)
			#Удаление
			И ЗначениеЗаполнено(СтрокаТаблицы.ДатаРешенияОЕВ)> ЗначениеЗаполнено(СтрокаТаблицы.ДатаРешенияОДоплате)) Тогда   //было решение о доплате но по прошлому заявлению
			#КонецУдаления
			#Вставка
			// +ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоИнвестДоходу() // №3357
			И СтрокаТаблицы.ДатаРешенияОЕВ > СтрокаТаблицы.ДатаРешенияОДоплате) Тогда
			// -ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоИнвестДоходу() // №3357
			#КонецВставки
			Если СтрокаТаблицы.ВключатьДопВзносы Тогда
				ПереводитьвРезервЕВ = Истина;
			Иначе
				Если СтрокаТаблицы.ТипСуммы = Справочники.уп_ТипыСуммОПС.ВзносыФиз
					ИЛИ СтрокаТаблицы.ТипСуммы = Справочники.уп_ТипыСуммОПС.ИДФиз Тогда
					ПереводитьвРезервЕВ = Истина;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		Если ПереводитьВРезервЕВ Тогда
			Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервЕВ;
		КонецЕсли;
		#Вставка
		// +ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоИнвестДоходу() // №3357
		КонецЕсли;
		// -ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоИнвестДоходу() // №3357
		#КонецВставки
	КонецЕсли;
	Движение.Сумма = ТекСумма;
	Движение.РублеДни = ТекРублеДни;
	Движение.Процент = ТекПроцент;
	Движение.ДнейВПериоде = Цел((КонецДня(КонецПериода)-НачалоДня(НачалоПериода)+1)/(60*60*24));
	Движение.НачПериода = НачалоДня(НачалоПериода);
	Движение.КонПериода = КонецДня(КонецПериода);
	Если ТекСумма<0 Тогда
		Движение.ОтрицательныеСуммыДляТрансляции = -ТекСумма;
	КонецЕсли;
	Движение.ИсточникИД = ИсточникИД;
КонецПроцедуры	

&ИзменениеИКонтроль("ДвижениеПоРезервам")
Процедура РасшОбщ_ДвижениеПоРезервам(ТекДоговорОПС, ТекТипСуммы, ТекСумма, СтрокаТаблицы)
	Если ТипРезерва = Перечисления.уп_ТипыРезервовОПС.Выплатной Тогда
		Движение = Движения.уп_РезервыОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период      = Дата;
		Движение.Организация = Организация;
		//Если СтрокаТаблицы.СостояниеДоговораОПС = Перечисления.уп_СостоянияДоговоровОПС.Закрыт
		//	и СтрокаТаблицы.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
		//	Движение.ДоговорОПС  = Справочники.уп_ДоговорыОПС.ПустаяСсылка();
		//Иначе
		#Удаление
		Если ПоДоговорам Тогда

			Движение.ДоговорОПС  = ТекДоговорОПС;
		КонецЕсли;	
		//КонецЕсли;

		#КонецУдаления
		#Вставка
		// +ХМНПФ 19.02.2019 ШадринАВ // ДвижениеПоРезервам() // №2052
			Движение.ДоговорОПС  = ТекДоговорОПС;
		#КонецВставки

		Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.Выплатной;
		Если ПоТипамСумм Тогда
			Движение.ТипСуммы  = ТекТипСуммы;
		КонецЕсли;
		Движение.Сумма       = ТекСумма;
		Движение.ДокументРегистрации = ДокументРегистрации;
		Движение.Движение    = Перечисления.уп_ВидыДвижений.ИДОПСРПВ;
		Если ИсточникИД = Перечисления.уп_ВидыИсточниковНачисленияИДОПС.ЗаСчетРОПС Тогда
			Движение.ВидДвиженияЕПС = Перечисления.епс_ВидыДвиженияПенсионныхНакоплений.Перевод_Из_РОПС_в_РВ;	
		ИначеЕсли ИсточникИД = Перечисления.уп_ВидыИсточниковНачисленияИДОПС.ЗаСчетСС Тогда
			Движение.ВидДвиженияЕПС = Перечисления.епс_ВидыДвиженияПенсионныхНакоплений.Пополнение_РВ_Собственные_Средства;	
		Иначе
			
		КонецЕсли; 
		
	ИначеЕсли ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервОПС Тогда
		Движение = Движения.уп_РезервыОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период      = Дата;
		Движение.Организация = Организация;
		Движение.ДоговорОПС  = Справочники.уп_ДоговорыОПС.ПустаяСсылка();
		Движение.ТипРезерва = ТипРезерва;
		Движение.Сумма       = ТекСумма;
		Движение.ДокументРегистрации = ДокументРегистрации;
		Движение.Движение    = Перечисления.уп_ВидыДвижений.ИДОПС;
	Иначе	
		Движение = Движения.уп_РезервыОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период      = Дата;
		Движение.Организация = Организация;
		Движение.ДоговорОПС  = ТекДоговорОПС;
		Движение.ТипРезерва  = ТипРезерва;
		Если ВедетсяРезервНаследников И ЗначениеЗаполнено(ТекДоговорОПС.ДатаРегистрацииСмерти) 
			И Дата > ТекДоговорОПС.ДатаРегистрацииСмерти И СтрокаТаблицы.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
			Если ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
				Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН;
			ИначеЕсли ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты Тогда
				Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ;
			КонецЕсли;	
		КонецЕсли;
		
		//резерв ЕВ
		Если ВедетсяРезервЕВ И ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда 
			ПереводитьвРезервЕВ = Ложь;
			#Вставка
			// +ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоРезервам() // №3357
			Если НЕ (ЗначениеЗаполнено(ТекДоговорОПС.ДатаРегистрацииСмерти)
				И Дата > ТекДоговорОПС.ДатаРегистрацииСмерти И СтрокаТаблицы.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти) Тогда
			// -ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоРезервам() // №3357
			#КонецВставки
			Если  (ЗначениеЗаполнено(СтрокаТаблицы.ДатаРешенияОЕВ) И НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаРешенияОДоплате)) //не было решения о доплате
				ИЛИ (ЗначениеЗаполнено(СтрокаТаблицы.ДатаРешенияОЕВ) И ЗначениеЗаполнено(СтрокаТаблицы.ДатаРешенияОДоплате)
				И СтрокаТаблицы.ДатаРешенияОЕВ>СтрокаТаблицы.ДатаРешенияОДоплате) Тогда   //было решение о доплате но по прошлому заявлению
				Если СтрокаТаблицы.ВключатьДопВзносы Тогда
					ПереводитьвРезервЕВ = Истина;
				Иначе
					Если ТекТипСуммы = Справочники.уп_ТипыСуммОПС.ВзносыФиз
						ИЛИ ТекТипСуммы = Справочники.уп_ТипыСуммОПС.ИДФиз Тогда
						ПереводитьвРезервЕВ = Истина;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
			Если ПереводитьВРезервЕВ Тогда
				Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервЕВ;
			КонецЕсли;	
			#Вставка
			// +ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоРезервам() // №3357
			КонецЕсли;
			// -ХМНПФ 15.10.2021 ШадринАВ // ДвижениеПоРезервам() // №3357
			#КонецВставки
   		КонецЕсли;
		Движение.ТипСуммы    = ТекТипСуммы;
		Движение.Сумма       = ТекСумма;
		Движение.ДокументРегистрации = ДокументРегистрации;
		Если ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты Тогда
			Движение.Движение    = Перечисления.уп_ВидыДвижений.ИДОПСРСВ;
			Если ИсточникИД = Перечисления.уп_ВидыИсточниковНачисленияИДОПС.ЗаСчетРОПС Тогда
				Если ЗначениеЗаполнено(ТекДоговорОПС.ДатаРегистрацииСмерти) 
					И Дата > ТекДоговорОПС.ДатаРегистрацииСмерти И СтрокаТаблицы.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
					Движение.ВидДвиженияЕПС = Перечисления.епс_ВидыДвиженияПенсионныхНакоплений.Перевод_Из_РОПС_в_РСВУмерших;
				Иначе
					Движение.ВидДвиженияЕПС = Перечисления.епс_ВидыДвиженияПенсионныхНакоплений.Перевод_Из_РОПС_в_РСВ;
				КонецЕсли;
			ИначеЕсли ИсточникИД = Перечисления.уп_ВидыИсточниковНачисленияИДОПС.ЗаСчетСС Тогда
				Если ЗначениеЗаполнено(ТекДоговорОПС.ДатаРегистрацииСмерти) 
					И Дата > ТекДоговорОПС.ДатаРегистрацииСмерти И СтрокаТаблицы.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
					Движение.ВидДвиженияЕПС = Перечисления.епс_ВидыДвиженияПенсионныхНакоплений.Пополнение_РСВУмерших_Собственные_Средства;	
				Иначе
					Движение.ВидДвиженияЕПС = Перечисления.епс_ВидыДвиженияПенсионныхНакоплений.Пополнение_РСВ_Собственные_Средства;	
				КонецЕсли;
			Иначе
			КонецЕсли; 
		Иначе
			Движение.Движение    = Перечисления.уп_ВидыДвижений.ИДОПС;
			Если ИсточникИД = Перечисления.уп_ВидыИсточниковНачисленияИДОПС.ЗаСчетРОПС Тогда
				Если ЗначениеЗаполнено(ТекДоговорОПС.ДатаРегистрацииСмерти) 
					И Дата > ТекДоговорОПС.ДатаРегистрацииСмерти И СтрокаТаблицы.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
					Движение.ВидДвиженияЕПС = Перечисления.епс_ВидыДвиженияПенсионныхНакоплений.Перевод_Из_РОПС_в_РПНУмерших;
				Иначе
					Движение.ВидДвиженияЕПС = Перечисления.епс_ВидыДвиженияПенсионныхНакоплений.Перевод_Из_РОПС_в_РПН;	
				Конецесли	
			ИначеЕсли ИсточникИД = Перечисления.уп_ВидыИсточниковНачисленияИДОПС.ЗаСчетСС Тогда
				Если ЗначениеЗаполнено(ТекДоговорОПС.ДатаРегистрацииСмерти) 
					И Дата > ТекДоговорОПС.ДатаРегистрацииСмерти И СтрокаТаблицы.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
					Движение.ВидДвиженияЕПС = Перечисления.епс_ВидыДвиженияПенсионныхНакоплений.Пополнение_РПНУмерших_Собственные_Средства;	
				Иначе
					Движение.ВидДвиженияЕПС = Перечисления.епс_ВидыДвиженияПенсионныхНакоплений.Пополнение_РПН_Собственные_Средства;	
				КонецЕсли;	
			Иначе
			КонецЕсли; 
		КонецЕсли;	
		Если СтрокаТаблицы.СостояниеДоговораОПС = Перечисления.уп_СостоянияДоговоровОПС.Закрыт 
			и (СтрокаТаблицы.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.Досрочное ИЛИ СтрокаТаблицы.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.НеВступилВСилу) И (НЕ НеСписыватьИДСразу) Тогда
			
			Движение = Движения.уп_РезервыОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период      = Дата;
			Движение.Организация = Организация;
			Движение.ДоговорОПС  = ТекДоговорОПС;
			Движение.ТипРезерва  = ТипРезерва;
			Движение.ТипСуммы    = ТекТипСуммы;
			Движение.Сумма       = ТекСумма;
			Движение.ДокументРегистрации = ДокументРегистрации;
			Движение.Движение    = Перечисления.уп_ВидыДвижений.ПереводВДругойПФ;
			
			Движение                     = Движения.уп_ПрочиеНачисленияОПС.Добавить();
			Движение.ВидДвижения         = ВидДвиженияНакопления.Приход;
			Движение.Период              = Дата;
			Движение.Организация         = Организация;
			Движение.ДоговорОПС          = ТекДоговорОПС;
			Движение.ДокументРегистрации = ДокументРегистрации;
			Движение.ТипСуммы            = ТекТипСуммы;
			Движение.ТипВыплаты          = Перечисления.уп_ТипыВыплат.ПереводВДругойПФ;
			
			//надо выяснить куда он ушел
			Если СтрокаТаблицы.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.Досрочное Тогда
				Движение.Участник = СтрокаТаблицы.СледующийСтраховщик;
				Сообщить("По договору № "+СокрЛП(ТекДоговорОПС.Код)+" средства начислены к выплате страховщику "+СокрЛП(СтрокаТаблицы.СледующийСтраховщик.Наименование));
			ИначеЕсли СтрокаТаблицы.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.НеВступилВСилу Тогда
				Движение.Участник = СтрокаТаблицы.ПредыдущийСтраховщик;
				Сообщить("По договору № "+СокрЛП(ТекДоговорОПС.Код)+" средства начислены к выплате страховщику "+СокрЛП(СтрокаТаблицы.ПредыдущийСтраховщик.Наименование));
			КонецЕсли;	
			Движение.Сумма = ТекСумма;
				
			Если ОтражатьВБухгалтерскомУчете  и ПроводкиПоНачислению Тогда
				уп_ОбщегоНазначенияУчетРезервов.ДобавитьСтрокуВТабБухУчет(ТабБухУчет, Дата, Организация, Перечисления.уп_ВидыДвижений.ПереводВДругойПФ, ТекДоговорОПС.Участник, ТекДоговорОПС.ДоговорКонтрагента,
				Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, СтрокаТаблицы.СледующийСтраховщик, СтрокаТаблицы.СледующийСтраховщик.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ТекСумма);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, РежимПроведения, СтрокаТЗ, СтруктураТЧ) Экспорт
	Если НЕ ПРОВЕДЕН Тогда
		#Если Сервер Тогда
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ИнвестДоходОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_РезервыОПС);
		#КонецЕсли
		Возврат;	
	КонецЕсли;
	
	Структура_ТЗ = СтруктураТЧ.ТЗНачислений;	
	СтрокиНаДобавление = Структура_ТЗ.ТЗ.НайтиСтроки(Новый Структура(Структура_ТЗ.Узел.Каспер_поле,СтрокаТЗ[Структура_ТЗ.Узел.Каспер_поле]));
	Для каждого стр из СтрокиНаДобавление Цикл
		Движение = Движения.уп_РезервыОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период      = стр.ХМ_ДатаВыплаты;
		Движение.Организация = Организация;
		Движение.ДоговорОПС  = стр.ДоговорОПС;
		Движение.ТипРезерва = стр.ТипРезерва;
		Движение.ТипСуммы  = стр.ТипСуммы;
		Движение.Сумма     = стр.Сумма;
		Движение.ДокументРегистрации = ДокументРегистрации;
		Если стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.Выплатной Тогда
			Движение.Движение    = Перечисления.уп_ВидыДвижений.ИДОПСРПВ;
		ИначеЕсли стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты Тогда
			Движение.Движение    = Перечисления.уп_ВидыДвижений.ИДОПСРСВ;
		ИначеЕсли стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
			Движение.Движение    = Перечисления.уп_ВидыДвижений.ИДОПС;
		ИначеЕсли ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервОПС Тогда
			Движение.Движение    = Перечисления.уп_ВидыДвижений.ИДРезервОПС;
			ВызватьИсключение "Необходимо учесть дополнительную аналитику по резурву ОПС!";
			//--Движение.ДоговорОПС  = стр.ТекДоговорОПС;
			//--Движение.ТипРезерва = ТипРезерва;
			//--Движение.ТипСуммы  = стр.ТипСуммы;
		КонецЕсли;

		Движение = Движения.уп_ИнвестДоходОПС.Добавить();
		Движение.Период = стр.ХМ_ДатаВыплаты;
		Движение.Организация = Организация;
		Если ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервОПС Тогда
//--			Движение.ДоговорОПС = Справочники.уп_ДоговорыОПС.ПустаяСсылка();
//--			Движение.ТипСуммы = Справочники.уп_ТипыСуммОПС.ПустаяСсылка();
		Иначе
			Движение.ДоговорОПС  = стр.ДоговорОПС;
			Движение.ТипСуммы  = стр.ТипСуммы;
		КонецЕсли;
		Движение.ТипРезерва = стр.ТипРезерва;
		Движение.Сумма     = стр.Сумма;
	КонецЦикла;	
	
	#Если Сервер Тогда
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ИнвестДоходОПС);
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_РезервыОПС);
	#КонецЕсли
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура ХМОбработкаПроведения(Отказ, Режим)
	Идентификатор =  "Форма27%";
	ФормаОтчета = "ИНСПН-В (Форма 27)";
	НазваниеОтчета = "Информация о результате инвестирования средств пенсионных накоплений," + 
	" отраженном на пенсионном счете накопительной пенсии застрахованного лица," + 
	" получающего ежемесячные выплаты за счет средств пенсионных накоплений, по итогам финансового года";
	Дата = ДатаРасчета;
	ХМ_ПодпискиНаСобытия_Сервер.ДобавитьОповещениеВРегистр(ЭтотОбъект, Дата, Идентификатор, НазваниеОтчета, ФормаОтчета);
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	Идентификатор =  "Форма28%";
	ФормаОтчета = "ИНСПН (Форма 28)";
	НазваниеОтчета = "Информация о результате инвестирования средств пенсионных накоплений," + 
	" отраженном на пенсионном счете накопительной пенсии застрахованного  лица," + 
	" не получающего ежемесячные выплаты за счет средств пенсионных накоплений, по итогам финансового года";
	ХМ_ПодпискиНаСобытия_Сервер.ДобавитьОповещениеВРегистр(ЭтотОбъект, Дата, Идентификатор, НазваниеОтчета, ФормаОтчета);
КонецПроцедуры
